app/controllers/api/v1/venues_controller.rb

INSERT INTO "seats" ("position", "row", "column", "venue_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["position", "a1"], ["row", 1], ["column", 1], ["venue_id", 8], ["created_at", "2020-09-15 09:27:40.477069"], ["updated_at", "2020-09-15 09:27:40.477069"]]
INSERT INTO "venues" ("rows", "columns", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["rows", 10], ["columns", 50], ["created_at", "2020-09-15 09:22:00.511625"], ["updated_at", "2020-09-15 09:22:00.511625"]]
---
            def import
                venue = Venue.new(venue_params)
                Venue.transaction do
                    venue.create_seats if venue.save