app/models/seat.rb

    def self.best_group_seat(amount_of_seats)
        close_seats ||= []

        venue = Venue.first

        (1..venue.rows).each do |row|
            row_selected = self.where(available: true, row: row)
            if row_selected.count > 2

                close_seats << row_selected.sort_by(&:column).min_by(amount_of_seats).first

                (0..(row_selected.count-1)).each do |index|
---
SELECT "venues".* FROM "venues" ORDER BY "venues"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "seats" WHERE "seats"."available" = $1  [["available", true]]
SELECT "seats".* FROM "seats" WHERE "seats"."available" = $1  [["available", true]]
SELECT COUNT(*) FROM "seats" WHERE "seats"."available" = $1 AND "seats"."row" = $2  [["available", true], ["row", 1]]