app/models/venue.rb

INSERT INTO "seats" ("position", "row", "column", "venue_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["position", "a1"], ["row", 1], ["column", 1], ["venue_id", 1], ["created_at", "2020-09-15 17:56:32.308275"], ["updated_at", "2020-09-15 17:56:32.308275"]]
---
    def create_seats
        (1..self.rows).each do |row|
            (1..self.columns).each do |col|
                position = (row - 1).to_i
                row_name = ROWS_GROUP_NAME[position] + col.to_s
                seats << Seat.new(position: row_name, row: row, column: col)

INSERT INTO "seats" ("position", "row", "column", "venue_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["position", "a1"], ["row", 1], ["column", 1], ["venue_id", 8], ["created_at", "2020-09-15 09:27:40.477069"], ["updated_at", "2020-09-15 09:27:40.477069"]]
UPDATE "seats" SET "available" = $1, "updated_at" = $2 WHERE "seats"."id" = $3  [["available", true], ["updated_at", "2020-09-15 23:35:02.679206"], ["id", 5001]]
---
    def seats_process(seats_params)
        array_seats ||= []
        seats_params.each {|_, v| array_seats << v}
        array_seats.each do |seat_param|
            seat = find_seat_by_position(seat_param["id"])
            seat.available = true if seat_param["status"] == "AVAILABLE"
            seat.save

SELECT "seats".* FROM "seats" WHERE "seats"."available" = $1  [["available", true]]
UPDATE "seats" SET "best_seat" = $1, "updated_at" = $2 WHERE "seats"."id" = $3  [["best_seat", true], ["updated_at", "2020-09-15 23:35:02.721720"], ["id", 5001]]
---
    def best_seat
        limit = get_limit
        close_row = Seat.where(available: true).group_by(&:row)
                                               .min_by { |_, v| (v[0].column - limit)}

        seat = find_seat_by_position(close_row[1][0].position)
        seat.best_seat = true
        seat.save

SELECT "seats".* FROM "seats" WHERE "seats"."position" = $1 LIMIT $2  [["position", "a1"], ["LIMIT", 1]]
---
    def find_seat_by_position position
        Seat.find_by_position(position)